'use client';
import Image from 'next/image';
import React from 'react';
import AdviceTopImg from '@/src/assets/advicesImg/ImgAdvises.png';
import { useRouter } from 'next/navigation';
import AdviceTopImg2 from '@/src/assets/advicesImg/ImgAdvice2.png';

const page = () => {
  const router = useRouter();

  const handleBackClick = (e) => {
    e.preventDefault();
    router.back();
  };
  return (
    <section className="flex justify-center">
      <div className="w-[80%] mb-[50px]">
        <div className=" mb-[38px] ">
          <h1 className="text-[48px] font-semibold leading-[58.51px] mb-[21px] ">
            6 порад, як контролювати
            <br /> себе під час спалаху гніву
          </h1>

          <Image src={AdviceTopImg} className="w-[100%]" alt="AdviceTopImg" />
        </div>
        <div class="grid grid-cols-2 grid-rows-1 gap-4 mb-[39px]">
          <div class="grid gap-4">
            <div>
              <div class="h-auto max-w-full  p-[35px] bg-[#D6EEFF] rounded-[10px]">
                <h1 className="text-[24px] font-semibold">
                   Зізнайтеся собі в тому, що ви гніваєтеся
                </h1>
                <p className="text-[20px] leading-[24.38px] max-w-[529px]">
                  Коли людина злиться, вона починає відчувати це фізично. За
                  словами американського терапевта Курта Сміта, людина в гніві
                  буквально відчуває жар. "Гнів часто викликає зміни в нашому
                  тілі, наприклад м'язову напругу, ригідність, болі у шиї,
                  прискорене серцебиття або задишку. Почуття втоми або жару без
                  видимої причини теж може бути ознакою невизнаного гніву", –
                  говорить він.
                </p>
              </div>
            </div>
            <div className="p-[35px] bg-[#D6EEFF] rounded-[10px]">
              <h1 className="text-[24px] font-semibold">Дайте собі час</h1>
              <p className="text-[20px] leading-[24.38px] max-w-[529px]">
                Дайте собі час заспокоїтися і не відповідати зопалу. "Тайм-аут
                дає вам час подумати про фактичний каталізатор, який розпалив
                гнів. Це допомагає ідентифікувати причину гніву й запобігти її
                повторній появі", – розповів американський психотерапевт Саніяя
                Майо. Звичайно, взяти паузу посеред гарячого спору не так
                просто. Нехай той, з ким ви спілкуєтеся знає, що вам просто
                потрібно трохи помовчати, інакше ваші дії можуть сприйняти як
                пасивну агресію.
              </p>
            </div>
            <div className="p-[35px] bg-[#D6EEFF] rounded-[10px]">
              <h1 className="text-[24px] font-semibold">
                Змініть тему розмови
              </h1>
              <p className="text-[20px] leading-[24.38px] max-w-[529px]">
                Припустимо, ви скористалися порадою вище, але ви все ще
                відчуваєте жар. Нічого страшного.Не обов’язково потрібно
                вирішувати ситуацію прямо зараз. За словами Мейо, якщо ви або
                ваш опонент як і раніше відчуваєте гнів, зміна теми розмови може
                бути хорошим способом впоратися з ним. "Іноді роздуми над
                людиною або ситуацією, яка вас дратує, тільки збільшують гнів.
                Зосередження на чомусь іншому допомагає змінити ваш настрій і
                те, як ви будете реагувати", – говорить психотерапевт. Як
                перевести розмову? Найпростіше – пожартувати й почати говорити
                про щось більш приємне.
              </p>
            </div>
            <div className="">
              <Image
                className="h-auto w-full rounded-[10px]"
                src={AdviceTopImg2}
                alt="AdviceTopImg2"
              />
            </div>
          </div>
          <div class="grid gap-4  ">
            <div className="p-[35px] bg-[#D6EEFF] rounded-[10px]">
              <h1 className="text-[24px] font-semibold">
                Прислухайтесь до бажань тіла
              </h1>
              <p className="text-[20px] leading-[24.38px] max-w-[529px]">
                "Запитайте себе, що хоче зробити ваш гнів? Зауважте, наприклад,
                що ваші руки, передпліччя і біцепси хочуть стискатися, або якщо
                ваш живіт стискається, то ви хочете кричати. Ви можете
                спробувати, безпечно і повільно, дозволити м'язам робити те, що
                їм подобається, але як ніби в уповільненому русі або під водою.
                Нехай ваші руки повільно, але міцно стискають щось безпечне (для
                об'єкта вашого гніву і для вас), або нехай ваш живіт
                стискається. Якщо ваше тіло хоче вдарити, знайдіть подушку -
                звичайно, будьте обережні", – сказала Бріттані Буффард,
                психотерапевт з Денвера. Звичайно, ці поради ідеальні тільки в
                тому випадку, якщо ви перебуваєте наодинці.
              </p>
            </div>
            <div className="p-[35px] bg-[#D6EEFF] rounded-[10px]">
              <h1 className="text-[24px] font-semibold">
                Зізнайтеся собі в тому, що ви гніваєтеся
              </h1>
              <p className="text-[20px] leading-[24.38px] max-w-[529px]">
                Тепер, коли ви заспокоїлися, подумайте про те, що підкріплює ваш
                гнів. Найчастіше гнів – це "вторинна емоція", яку ми
                використовуємо в якості маски або захисту для зовсім іншого
                почуття (наприклад, сорому або зніяковілості). "Якщо ви зможете
                зрозуміти свої справжні емоції, тоді ви дійсно зможете поглянути
                на ситуацію з боку і з'ясувати, чому стався спалах гніву", –
                сказав Патрік Дейві Таллі, терапевт з Лос-Анджелеса.
                <br /> Після того, як ви визначили, що дійсно провокує ваш гнів,
                ви отримаєте уявлення про свої потреби: можливо, ви дорікнули
                співробітника не тому що ви думаєте, що він некомпетентний, а
                тому що ви, як правило, відчуваєте себе перевантаженими своєю
                роботою. Коли ви розкриєте свої справжні емоції, ви зможете
                повідомити про це людині, з якою трапився конфлікт. У ситуації,
                яка запропонована вище, ви принесете вибачення співробітнику,
                поясните, що зламалися та визнаєте, що це не виправдовує вашу
                поведінку.
              </p>
            </div>
            <div className="p-[35px] bg-[#D6EEFF] rounded-[10px]">
              <h1 className="text-[24px] font-semibold">Змініть тон розмови</h1>
              <p className="text-[20px] leading-[24.38px] max-w-[529px]">
                Використовуйте свої справжні емоції, щоб донести причину гніву
                своєму опоненту. "Я відчуваю розчарування, коли ви мене
                критикуєте, бо здається, що ви не довіряєте мені приймати
                правильні для себе рішення", – наводить приклад психотерапевт і
                сексотерапевт Меган Негенданк. Більш ворожий підхід "ви так мене
                засуджуєте і взагалі поняття не маєте що говорите" – навряд чи
                дасть співрозмовнику зрозуміти що не так.
              </p>
            </div>
          </div>
        </div>
        <button
          onClick={handleBackClick}
          className="text-base font-semibold border  px-4 py-2 border-black rounded-lg">
          Повернутися назад
        </button>
      </div>
    </section>
  );
};

export default page;
